Repository: yamanISyaman/Tickety-Tock
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Blog
ar: المدونة

source: Categories
ar: الفئات

source: All
ar: الكل

source: Show All Products
ar: كل المنتجات

source: Oops! Seems Empty, reset the filters or try something else
ar: يبدو أنه لا يوجد أي منتجات، أعد ضبط الفلتر أو جرّب شيئاً آخر

source: Tickety Tock - Contact
ar: تيكيتي توك - تواصل معنا

source: Contact Us
ar: تواصل معنا

source: Get In Touch
ar: ابقى على تواصل

source: Do you have anything in your mind to let us know? Kindly don't delay to connect to us by means of our contact form.
ar: هل تفكر بشيء يجب أن نعرفه؟ لطفاً لا تتأخر في التواصل معنا عن طريق وسائل التواصل المتوفرة

source: Address
ar: العنوان

source: Syria, Damascus, Baramkeh
ar: سوريا، دمشق، برامكة

source: Phone
ar: الهاتف

source: Email
ar: الإيميل

source: Opening Hours
ar: ساعات الافتتاح

source: Sunday – Thursday
ar: الأحد - الخميس

source: Sun-Thu
ar: الأحد - الخميس

source: Tickety Tock - Home
ar: تيكيتي توك - الرئيسية

source: We make your dream <br> style a reality
ar: سنحول موضة أحلامك <br>إلى حقيقة

source: Since 1975, we've been weaving tales of time through the threads of your life, guided by the finest colors, tools, and expertise.
ar: منذ عام 1975, لقد نسجنا حكايات الزمن عبر خيوط حياتك، مسترشدين بأرقى الألوان والأدوات والخبرات.

source: Know more
ar: إعرف المزيد

source: colors that fit <br> Your Personality
ar: ألوان تناسب <br> شخصيتك

source: Customer Support <br>At Any Time You Need it
ar: خدمة زبائن<br> في أي وقت تحتاجه

source: Our Featured Products
ar: منتجاتنا المتميزة

source: Here are some of our products that you would like
ar: هذه بعض منتجاتنا التي قد تعجبك

source: Our products Categories
ar: الفئات الخاصة بمنتجاتنا

source: Need a choosing help? Read our blogs
ar: هل تحتاج لمساعدة في الإختيار؟ اقرأ مدوناتنا

source: Stay updated with latest trends, inspiration, expert tips and more
ar: ابقى مطلعاً على آخر الأحداث والأفكار ونصائح الخبراء وأكثر

source: All that and more
ar: كل هذا وأكثر

source: colors, brands and categories
ar: الألوان والماركات والفئات

source: contact us
ar: تواصل معنا

source: Home
ar: الرئيسية

source: Products
ar: المنتجات

source: Contact
ar: التواصل

source: Tickety Tock was opened in 1975 as one small store and every year our name is spreading wider and wider
ar: تيكيتي توك أفتتح عام 1975 كمتجر صغير وكل عام أسمنا ينتشر في العالم أكثر فأكثر

source: Contact Info
ar: معلومات التواصل

source: Newsletter
ar: خدمة الأخبار

source: Enter your email address
ar: اكتب عنوان بريدك الإلكتروني

source: Subscribe
ar: اشترك

source: Product Details
ar: تفاصيل المنتج

source: Brand
ar: الماركة

source: Colors
ar: الألوان

source: Description
ar: الوصف

source: Specification
ar: تخصيصات

source: Related Products
ar: المنتجات المشابهة

source: Tcikety Tock - Products
ar: تيكيتي توك - المنتجات

source: Modern products
ar: منتجات عصرية

source: Modern products with an aesthetic touch to engrave the most beautiful memories in our minds.
ar: منتجات عصرية بلمسة جمالية لتحفر أجمل الذكريات في الأذهان

source: purchase now
ar: اطلب الآن

source: Enter Search Keywords
ar: أكتب كلمة بحث

source: Brands
ar: الماركات

source: Case Materials
ar: مادة الهيكل

source: Surfaces Finishes
ar: طلاء السطح

source: Collections
ar: المجموعات

source: Our Products
ar: منتجاتنا

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Name
ar: الاسم

source: Logo
ar: الشعار

source: Specifications
ar: التخصيصات

source: summary
ar: الخلاصة

source: Tag
ar: علامة

source: Image
ar: الصورة

source: Case_Material
ar: مادة_الهيكل

source: Surface_Finishes
ar: طلاء_السطح

source: Collection
ar: تجميعات

source: Title
ar: العنوان
